# Напишите программу которая на входе принимает 5 числе.
# а на ввыходе выдает максимальное число.

#nums = [2,5,6,7,3]
#max = nums[0]
 
INDEX = 5
nums = []
for num in range(0,INDEX):
    nums.append(int(input('Введите число: \n')))
print(f'max = {max(nums)}')


# Второй вариант

# n = int(input())

# numbers = 
# Время 1-02-08
